---
kind: other
id: Properties.T:Autodesk.Revit.DB.SharedParameterApplicableRule
source: html/42ff5e7f-2706-8d91-2416-120a317c76af.htm
---
# SharedParameterApplicableRule Properties

Specifies whether the .NET object represents a valid Revit entity.